Examinator/src/Catalogs/ШкалыОценокСУО/ШкалыОценокСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШкалыОценокСУО</name>
  <predefined>
    <items>
      <name>Двухбалльная</name>
      <description>Двухбалльная</description>
    </items>
    <items>
      <name>Десятибалльная</name>
      <description>Десятибалльная</description>
    </items>
    <items>
      <name>НеОценивается</name>
      <description>Не оценивается</description>
    </items>
    <items>
      <name>Пятибалльная</name>
      <description>Пятибалльная</description>
    </items>
    <items>
      <name>Стобалльная</name>
      <description>Стобалльная</description>
    </items>
  </predefined>
</mdclass:Catalog>

Examinator/src/Catalogs/ЭлементыШкалыОценокСУО/ЭлементыШкалыОценокСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыШкалыОценокСУО</name>
  <owners>Catalog.ШкалыОценокСУО</owners>
  <attributes>
    <name>КоличествоБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияБаллов</name>
    <comment>Используется для получения оценки из количества баллов</comment>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ШкалыОценокСУО/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Оценки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Оценки.Наименование КАК Наименование,
		|	Оценки.Ссылка КАК Оценка,
		|	Оценки.КоличествоБаллов КАК БаллыЗа
		|ИЗ
		|	Справочник.ЭлементыШкалыОценокСУО КАК Оценки
		|ГДЕ
		|	Оценки.Владелец = &ШкалаОценок
		|
		|УПОРЯДОЧИТЬ ПО
		|	Оценки.Код";
	
	Запрос.Параметры.Вставить("ШкалаОценок", Объект.Ссылка);	
	ТаблицаОценок = Запрос.Выполнить().Выгрузить();	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияБаллов.Ссылка КАК Оценка,
		|	ЗначенияБаллов.Значение КАК Балл
		|ИЗ
		|	Справочник.ЭлементыШкалыОценокСУО.ЗначенияБаллов КАК ЗначенияБаллов
		|ГДЕ
		|	ЗначенияБаллов.Ссылка В(&Оценки)";
	
	Запрос.УстановитьПараметр("Оценки", ТаблицаОценок.ВыгрузитьКолонку("Оценка"));
	
	ТаблицаБалловОценок = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТО Из ТаблицаОценок Цикл
		НоваяСтрокаТО = Оценки.Добавить();
		НоваяСтрокаТО.Оценка = СтрокаТО.Оценка;
		НоваяСтрокаТО.БаллыДо = МаксимальноеЗначениеБаллаОценки(НоваяСтрокаТО.Оценка, ТаблицаБалловОценок);
		НоваяСтрокаТО.БаллыЗа = СтрокаТО.БаллыЗа;
		НоваяСтрокаТО.Наименование = СтрокаТО.Наименование;		
	КонецЦикла;
	
	Оценки.Сортировать("БаллыДо"); // На случай, если код оценки не соответствует реальным баллам
	
	ПересчитатьЗначениеБаллыОт();	
	
КонецПроцедуры

&НаСервере
Функция МаксимальноеЗначениеБаллаОценки(Оценка, ТаблицаБалловОценок)
	МаксимальныйБаллОценки = 0;
	Для каждого Строка Из ТаблицаБалловОценок Цикл
		Если Строка.Оценка = Оценка И Строка.Балл > МаксимальныйБаллОценки Тогда
			МаксимальныйБаллОценки = Строка.Балл;
		КонецЕсли;
	КонецЦикла;
	Возврат МаксимальныйБаллОценки;
КонецФункции

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Делаем проверки
	
	Если Оценки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Оценки не заданы'"),
				,
				"Оценки",
				,
				Отказ);
		Возврат;
	КонецЕсли;
	
	ПредыдущееКоличествоБаллов = -1;

	Для каждого СтрокаТО Из Оценки Цикл

		Если СтрокаТО.БаллыДо <= ПредыдущееКоличествоБаллов Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Количество баллов следующей оценки должно быть больше, чем у предыдущей'"),
				,
				"Оценки["+ ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(Оценки.Индекс(СтрокаТО)) +"].БаллыДо",
				,
				Отказ);
			Возврат;
		КонецЕсли;
		
		ПредыдущееКоличествоБаллов = СтрокаТО.БаллыДо;

	КонецЦикла;	
	
	Если ПредыдущееКоличествоБаллов <> 100 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Количество баллов наивысшей оценки должно равняться 100'"),
				,
				"Оценки["+ ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(Оценки.Индекс(СтрокаТО)) +"].БаллыДо",
				,
				Отказ);
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТО Из Оценки Цикл
	
		Если СтрокаТО.БаллыЗа > СтрокаТО.БаллыДо ИЛИ СтрокаТО.БаллыЗа < СтрокаТО.БаллыОт Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Значение колонки ""Оценка в баллы"" должно соответствовать значению колонки ""Баллы в оценку"" '"),
				,
				"Оценки["+ ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(Оценки.Индекс(СтрокаТО)) +"].БаллыЗа",
				,
				Отказ);
			Возврат;			
		КонецЕсли;
	
	КонецЦикла;
	
	// Записываем новые оценки или обновляем существующие
	
	Для каждого СтрокаТО Из Оценки Цикл
		
		Если ЗначениеЗаполнено(СтрокаТО.Оценка) Тогда
			ОценкаОбъект = СтрокаТО.Оценка.ПолучитьОбъект();
		Иначе
			ОценкаОбъект = Справочники.ЭлементыШкалыОценокСУО.СоздатьЭлемент();
			ОценкаОбъект.Заполнить(Неопределено);
			ОценкаОбъект.Владелец = ТекущийОбъект.Ссылка;			
		КонецЕсли;				
		
		ОценкаОбъект.Код = Оценки.Индекс(СтрокаТО);
		ОценкаОбъект.КоличествоБаллов = СтрокаТО.БаллыЗа;
		ОценкаОбъект.Наименование = СтрокаТО.Наименование;
		
		ЗаполнитьТабличнуюЧастьЗначенияБаллов(ОценкаОбъект, СтрокаТО.БаллыОт, СтрокаТО.БаллыДо);
		
		ОценкаОбъект.Записать();
		
		СтрокаТО.Оценка = ОценкаОбъект.Ссылка;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьЗначенияБаллов(ОценкаОбъект, БаллыОт, БаллыДо)
	
	ОценкаОбъект.ЗначенияБаллов.Очистить();
	
	Для ТекущийБалл = БаллыОт По БаллыДо Цикл
		
		НоваяСтрокаТЧ = ОценкаОбъект.ЗначенияБаллов.Добавить();
		НоваяСтрокаТЧ.Значение = ТекущийБалл;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыОценки

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Оценки

&НаКлиенте
Процедура ОценкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПересчитатьЗначениеБаллыОт();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если Объект.Ссылка.Пустая() Тогда
		Элементы.ДекорацияПослеЗаписи.Видимость = Истина;
	Иначе
		Элементы.ДекорацияПослеЗаписи.Видимость = Ложь;
		Элементы.Оценки.ИзменятьСоставСтрок = Ложь;
		Элементы.Оценки.ИзменятьПорядокСтрок = Ложь;
		Элементы.Оценки.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	КонецЕсли;	

	ЭтоПолныйИнтерфейс = ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");
	
	Элементы.ДекорацияПодсказкаЭкзаменатор.Видимость = НЕ ЭтоПолныйИнтерфейс;
	Элементы.ДекорацияПодсказка.Видимость = ЭтоПолныйИнтерфейс;

	Элементы.ОценкиБаллыЗа.Видимость = ЭтоПолныйИнтерфейс;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьЗначениеБаллыОт()
	
	ПредыдущееКоличествоБаллов = -1;
	
	Для каждого СтрокаТО Из Оценки Цикл
		СтрокаТО.БаллыОт = ПредыдущееКоличествоБаллов + 1; 
	    ПредыдущееКоличествоБаллов = СтрокаТО.БаллыДо;
		Если СтрокаТО.БаллыЗа < СтрокаТО.БаллыОт ИЛИ СтрокаТО.БаллыЗа > СтрокаТО.БаллыДо Тогда
			СтрокаТО.БаллыЗа = СтрокаТО.БаллыДо;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
